Revit 2026 API

# AdvancedWoodWoodUseRays Property

---

The property labeled "Use rays feature" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodUseRays { get; }
```
```vb
Public Shared ReadOnly Property WoodUseRays As String
	Get
```
```cpp
public:
static property String^ WoodUseRays {
	String^ get ();
}
```
```fsharp
static member WoodUseRays : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace